app/controllers/games_controller.rb

SELECT  "gamemodels".* FROM "gamemodels" WHERE "gamemodels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def result

		@fc_result = Gamemodel.find 1